; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v7 ?v10)
             (pred_7 ?v1 ?v4)
             (pred_10 ?v7 ?v4)
             (pred_6 ?v13 ?v7 )
	     (pred_5 ?v7)
             (pred_8 ?v8)
             (pred_4 ?v1)
             (pred_11 ?v4)
             (pred_3 ?v7)
             (pred_2 ?v1)
             (pred_12 ?v7)
             (pred_9 ))



(:action op_5
:parameters (?v9 ?v12 ?v11 ?v5)
:precondition (and (pred_8 ?v9) (pred_8 ?v12) (pred_4 ?v11) (pred_11 ?v5)
          (pred_1 ?v9 ?v12) (pred_7 ?v11 ?v5)
                   (pred_10 ?v12 ?v5) (pred_5 ?v9) 
                   (pred_3 ?v12) (pred_2 ?v11))
:effect (and  (pred_12 ?v12) (not (pred_3 ?v12))))


(:action op_4
:parameters (?v9 ?v3)
:precondition (and (pred_8 ?v9) (pred_8 ?v3)
               (pred_5 ?v9) (pred_1 ?v9 ?v3) (pred_12 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v9))))

(:action op_1
:parameters (?v9 ?v11)
:precondition (and (pred_8 ?v9) (pred_4 ?v11) 
                  (pred_5 ?v9) (pred_6 ?v11 ?v9) (pred_9 ))
:effect (and (pred_2 ?v11)
   (not (pred_6 ?v11 ?v9)) (not (pred_9 ))))


(:action op_3
:parameters (?v9 ?v2 ?v6)
:precondition (and (pred_8 ?v9) (pred_4 ?v2) (pred_4 ?v6)
                  (pred_5 ?v9) (pred_2 ?v6) (pred_6 ?v2 ?v9))
:effect (and (pred_2 ?v2) (pred_6 ?v6 ?v9)
        (not (pred_2 ?v6)) (not (pred_6 ?v2 ?v9))))

(:action op_2
:parameters (?v9 ?v11)
:precondition (and (pred_8 ?v9) (pred_4 ?v11) 
                  (pred_5 ?v9) (pred_2 ?v11))
:effect (and (pred_9 ) (pred_6 ?v11 ?v9) (not (pred_2 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_03 obj_09 obj_16 obj_14 obj_18 obj_22 obj_06 obj_15 obj_12 obj_11 obj_10 obj_04 obj_01 obj_19 obj_17
    obj_20 obj_02 obj_21
    obj_07 obj_08 obj_13
    )

    (:init
       (pred_9)

       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_09)
       (pred_8 obj_16)
       (pred_8 obj_14)
       (pred_8 obj_18)
       (pred_8 obj_22)
       (pred_8 obj_06)
       (pred_8 obj_15)
       (pred_8 obj_12)
       (pred_8 obj_11)
       (pred_8 obj_10)
       (pred_8 obj_04)
       (pred_8 obj_01)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_11 obj_20)
       (pred_11 obj_02)
       (pred_11 obj_21)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_13)

       (pred_1 obj_05 obj_14)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_03 obj_18)
       (pred_1 obj_03 obj_09)
       (pred_1 obj_03 obj_05)
       (pred_1 obj_09 obj_22)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_14 obj_15)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_14 obj_05)
       (pred_1 obj_18 obj_12)
       (pred_1 obj_18 obj_22)
       (pred_1 obj_18 obj_03)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_22 obj_11)
       (pred_1 obj_22 obj_06)
       (pred_1 obj_22 obj_09)
       (pred_1 obj_22 obj_18)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_06 obj_22)
       (pred_1 obj_15 obj_04)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_11 obj_19)
       (pred_1 obj_11 obj_10)
       (pred_1 obj_11 obj_22)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_10 obj_17)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_10 obj_11)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_04 obj_15)
       (pred_1 obj_01 obj_19)
       (pred_1 obj_01 obj_12)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_19 obj_17)
       (pred_1 obj_19 obj_11)
       (pred_1 obj_19 obj_01)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_17 obj_19)
       (pred_3 obj_18)
       (pred_3 obj_22)
       (pred_3 obj_04)
       (pred_10  obj_18 obj_20)
       (pred_10  obj_22 obj_02)
       (pred_10  obj_04 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_03)
       (pred_12 obj_09)
       (pred_12 obj_16)
       (pred_12 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_15)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_12 obj_17)

       (pred_7  obj_07 obj_20)
       (pred_7  obj_08 obj_02)
       (pred_7  obj_13 obj_21)
       (pred_6 obj_07 obj_05)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_13 obj_17)
       (pred_5 obj_17)
    )

    (:goal (and
       (pred_6 obj_08 obj_15)
    ))
(:constraints
  (always (not (pred_5 obj_11)))
)
)

; plan
1. (op_4 obj_17 obj_19)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_19)
   goals met: 0 of 1
2. (op_4 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 0 of 1
3. (op_4 obj_01 obj_12)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_08)
   deleted: (pred_6 obj_08 obj_12) (pred_9)
   added: (pred_2 obj_08)
   goals met: 0 of 1
5. (op_4 obj_12 obj_15)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_15)
   goals met: 0 of 1
6. (op_2 obj_15 obj_08)
   deleted: (pred_2 obj_08)
   added: (pred_9) (pred_6 obj_08 obj_15)
   goals met: 1 of 1
